Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་བཤེས་གཉེན་གྱི་ཚོགས་ནི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་སྒོ་ཡིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of kalyāṇamitras results in being a entranceway to all virtues. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་པའི་ཚོགས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་སླུ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of intention results in not breaking one’s promises to the entire world. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱོར་བའི་ཚོགས་ནི་ཚོགས་ཐམས་ཅད་མཐར་ཕྱིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of application results in carrying through all accumulations. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལྷག་པའི་བསམ་པའི་ཚོགས་ནི་ཁྱད་པར་དུ་འགྲོ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of resolute motivation results in reaching excellence. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནང་དུ་ཡང་དག་འཇོག་པའི་ཚོགས་ནི་ཇི་ལྟར་ཐོས་པའི་ཆོས་སྒྲུབ་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of seclusion results in the practice of the Dharma as has been heard. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསྡུ་བའི་དངོས་པོའི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of the activities that gather beings results in the ripening of all beings. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའི་ཚོགས་ནི་དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of maintaining the good Dharma results in the lineage of the Three Jewels being unbroken. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་བསྔོ་བའི་ཆོ་ག་ཤེས་པ་ལ་མཁས་པའི་ཚོགས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of skillfulness in knowing the practices of dedication results in the purification of a buddha realm. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་ལ་མཁས་པའི་ཚོགས་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་ཏེ།
en: The bodhisattvas’ accumulation of skillful methods results in fulfilling the wisdom of an omniscient one. “ ‘

source: རིགས་ཀྱི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚོགས་རྣམ་པར་དག་པའི་སྒོ་ཡང་དག་པར་སྡུད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡིན་ནོ།
en: That, noble son, is the Dharma teaching that includes the entrances to the pure accumulations of the bodhisattvas.’ “

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཆེན་པོ་ལ་རྣམ་པར་གཟིགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ལ་བོས་ཏེ་བཀའ་སྩལ་པ། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་འཇིགས་པའི་རྒྱན་ཇི་ལྟ་བུས་བརྒྱན་ན་བཟོད་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན།
en: Then, noble son, the Tathāgata Ratnagarbha looked at the assembly of bodhisattvas and addressed the bodhisattva mahāsattva Mahākāruṇika, saying, ‘Mahākāruṇika, what is the nature of the adornment of fearlessness that adorns a bodhisattva mahāsattva who perfects patience?

source: དོན་དམ་པ་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འབད་པ་དོན་ཡོད་པ་ཡོངས་སུ་འཛིན་པའི་སེམས་དང་། ཁམས་གསུམ་པ་ཐམས་ཅད་དང་།
en: The efforts of the bodhisattva mahāsattva who sees the ultimate truth are fixed upon what is beneficial and are without fixation upon the entire three realms or upon any being.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པའི་སེམས་གང་ཡིན་པ་དེ་ནི་དགེ་སྦྱོང་གི་ཆོས་མི་འཇིགས་པ་ཆེན་པོ་ཞེས་བྱ་སྟེ།
en: That quality of a practitioner is called the great fearlessness.

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་གང་གི་སེམས་ཆོས་ཐམས་ཅད་ལ་ནམ་མཁའ་དང་ལག་པར་མཉམ་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་མི་འཇིགས་པའི་རྒྱན་ཡིན་ནོ།
en: When one has a mind for which space and one’s hand are the same amidst all phenomena, that, Mahākāruṇika, is the fearlessness of a bodhisattva. “ ‘

source: །ཇི་ལྟར་ན་བཟོད་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན། འདི་ལྟ་སྟེ། བྱམས་པ་དང་། བདག་མེད་པ་དང་། སྙིང་རྗེ་དང་། སེམས་ཅན་མེད་པ་ཉིད་དང་། དགའ་བ་དང་། ཡིད་བྱུང་བ་དང་། བཏང་སྙོམས་དང་། གང་ཟག་མེད་པ་ཉིད་དང་། སྦྱིན་པ་དང་། དུལ་བའི་སེམས་ཉིད་དང་། ཚུལ་ཁྲིམས་དང་། ཞི་བའི་སེམས་ཉིད་དང་། བཟོད་པ་དང་། བཟོད་པའི་སེམས་ཉིད་དང་། བརྩོན་འགྲུས་དང་། དབེན་པའི་སེམས་ཉིད་དང་། བསམ་གཏན་དང་། ངེས་པར་སེམས་པའི་སེམས་ཉིད་དང་། ཤེས་རབ་དང་། རྒྱ་ཆེ་བའི་སེམས་ཉིད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། དྲན་པ་མེད་པ་དང་། ཡིད་ལ་བྱེད་པ་མེད་པའི་སེམས་དང་། ཡང་དག་པའི་སྤོང་བ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པའི་སེམས་ཉིད་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། ཆོས་ཐམས་ཅད་འགྲོ་བ་མེད་པའི་སེམས་ཉིད་དང་། དད་པ་དང་། ཐོགས་པ་མེད་པའི་སེམས་ཉིད་དང་། དྲན་པ་དང་། རང་བྱུང་གི་མཚན་ཉིད་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པར་བྱེད་པའི་སེམས་ཉིད་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་དང་། དབང་པོ་མེད་པའི་སེམས་ཉིད་དང་། སྟོབས་དང་། མི་རྫི་བའི་སེམས་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བློ་རབ་ཏུ་འབྱེད་པའི་སེམས་ཉིད་དང་། ལམ་དང་། སྒོམ་པའི་སེམས་ཉིད་དང་། ཞི་གནས་དང་། ཉེ་བར་ཞི་བའི་སེམས་ཉིད་དང་། ལྷག་མཐོང་དང་། རྨོངས་པ་མེད་པའི་སེམས་ཉིད་དང་། འཕགས་པའི་བདེན་པ་བསྒོམ་པ་དང་།
en: How is patience perfected?

source: ཤིན་ཏུ་ཡོངས་སུ་ཤེས་པ་བསྒོམ་པའི་སེམས་ཉིད་དང་། སངས་རྒྱས་ཡིད་ལ་བྱེད་པ་དང་། མུན་པ་མེད་པའི་སེམས་ཉིད་དང་། ཆོས་ཡིད་ལ་བྱེད་པ་དང་། ཆོས་ཀྱི་དབྱིངས་མཉམ་པའི་སེམས་ཉིད་དང་། དགེ་འདུན་ཡིད་ལ་བྱེད་པ་དང་། གནས་པ་མེད་པའི་སེམས་ཉིད་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདོད་མ་ནས་རྣམ་པར་དག་པའི་སེམས་ཉིད་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་། ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པའི་སེམས་ཉིད་དང་། ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པ་དང་། ནམ་མཁའ་དང་མཉམ་པའི་སེམས་ཉིད་དང་། མཚན་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། མཚན་མ་མེད་པའི་སེམས་ཉིད་དང་།
en: When one does not perceive even the slightest quality to be understood or realized, yet one is dedicated to the qualities that are not yet ripened: both kindness and selflessness; both compassion and insubstantiality, rejoicing and remorse; both impartiality and personlessness, generosity and a tamed mind; both correct conduct and a pacified mind; both patience and a patient mind; both diligence and a mind in solitude; both meditation and a contemplative mind; both wisdom and an expansive mind, a mind that rests in mindfulness and has no mindfulness or attentiveness; both complete renunciation and a mind with neither arising nor cessation; both the bases of miraculous powers and a mind that does not go toward phenomena; both faith and an unimpeded mind; both memory and a self-arising mind; both samādhi and a mind in samādhi; both the faculty of wisdom and a mind that transcends the sense faculties; both strength and an invincible mind; both the factors for enlightenment and a mind that discerns through the intellect; both the path and a mind in meditation; both śamatha and a stilled mind; both vipaśyanā and a mind free of perplexity; both meditation on the noble truths and a mind that meditates on complete comprehension; both being focused on the Buddha and a mind free of darkness; both being focused on the Dharma and a mind that is the same as the essence of phenomena; both being focused on the Saṅgha and a nondependent mind; both the ripening of beings and a mind that is primordially pure; both the possession of the Dharma and a mind inseparable from the essence of phenomena; both the purification of a realm and a mind that is equal to space; both the perfection of the features of a great being and a mind without features; both the attainment of patience and a mind without perception; both the level of irreversibility and a mind of engagement and reversal; both a mind adorned by the essence of enlightenment and a mind that has the essence of the three realms; both a mind that defeats the māras that come from all beings and a mind that takes care of all beings; both enlightenment and a mind that realizes the equality of all phenomena; both turning the wheel of the Dharma and a mind without the turning of all phenomena; and both manifestation of passing into great parinirvāṇa and a mind that knows the nature of saṃsāra.’ ”

source: བཟོད་པ་ཐོབ་པ་དང་། དམིགས་པ་མེད་པའི་སེམས་ཉིད་དང་། ཕྱིར་མི་ལྡོག་པའི་ས་དང་། འཇུག་པ་དང་ལྡོག་པའི་སེམས་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་དང་། ཁམས་གསུམ་གྱི་སྙིང་པོ་ལེན་པའི་སེམས་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ལས་བདུད་ཚར་གཅད་པའི་སེམས་དང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་པའི་སེམས་ཉིད་དང་། བྱང་ཆུབ་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་རྟོགས་པའི་སེམས་ཉིད་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། ཆོས་ཐམས་ཅད་བསྐོར་བ་མེད་པའི་སེམས་ཉིད་དང་།
en: When this Dharma teaching was being given, 6,400,000 bodhisattvas attained the forbearance that comes from realizing the birthlessness of phenomena.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཀུན་ཏུ་སྟོན་པ་དང་། འཁོར་བའི་རང་བཞིན་གྱི་སེམས་ཉིད་ཀྱི་ཆོས་དེ་ལ་གང་རྗེས་སུ་རྟོགས་པར་འགྱུར་བའམ།
en: They had come from the ten directions to Vulture Peak Mountain, into the presence of the Tathāgata Śākyamuni, in order to listen to that ancient instruction on the entrance to the samādhis and the Dharma teaching on the entrances to the pure accumulations.

source: རབ་ཏུ་རྟོགས་པར་བྱ་བ་ཕྲ་རབ་ཙམ་ཡང་མི་དམིགས་ཤིང་། རྣམ་པར་སྨིན་པ་མེད་པའི་ཆོས་ལ་མོས་པར་བྱེད་པའོ། །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་གང་དག་ཕྱོགས་བཅུ་ནས་སྔོན་གྱི་ཚུལ་གྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པ་དང་། ཚོགས་རྣམ་པར་དག་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཉན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ས་ཡ་ཕྲག་དྲུག་དང་བཞི་འབུམ་པོ་དེ་དག་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གཱའི་ཀླུང་བཞི་བཅུ་རྩ་བརྒྱད་ཀྱི་བྱེ་མ་སྙེད་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Then the Tathāgata Śākyamuni said, “Noble son, when the tathāgata arhat samyaksam­buddha Ratnagarbha gave this Dharma teaching, bodhisattva mahāsattvas as numerous as the grains of sand in forty-eight Ganges Rivers attained the forbearance that comes from realizing the birthlessness of phenomena.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཕྲ་རབ་སྙེད་ཀྱིས་ནི་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་གྱུར་ཏོ།
en: As many bodhisattva mahāsattvas as there are particles in a world of four continents attained the level of irreversibility.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱིས་ནི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པ་དང་། ཚོགས་རྣམ་པར་དག་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཐའ་དག་ཡོངས་སུ་རྫོགས་ཤིང་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་གྱུར་ཏོ།
en: Bodhisattva mahāsattvas as numerous as the grains of sand in the Ganges River perfected all the instructions on entrances to the samādhis and the Dharma teaching on pure accumulations, and realized pure wisdom. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་ཡང་མཆོག་ཏུ་དགའ་བ་དང་རབ་ཏུ་དང་བ་དེས་གཞོན་ནུ་ལོ་ཉི་ཤུ་ལོན་པ་ལྟ་བུར་རེད་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་འབྲིང་དུ་འབྲང་བར་གྱུར་ཏོ།
en: Noble son, the bodhisattva mahāsattva Mahākāruṇika, filled with joy and faith, and having become like a twenty-year-old youth, stood behind the Tathāgata Ratnagarbha as his attendant. “

source: །རིགས་ཀྱི་བུ་རྒྱལ་པོ་བདུད་རྩི་དག་པ་དེ་ཡང་བུ་སྟོང་དང་། ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་དང་། གཞན་ཡང་སྲོག་ཆགས་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་དང་ལྷན་ཅིག་འགྲོགས་ཏེ།
en: Noble son, they were accompanied by King Amṛtaśuddha, his thousand sons, the eighty thousand minor kings, and 920,000,000 other beings.

source: མངོན་པར་བྱུང་ཞིང་རབ་ཏུ་བྱུང་ནས་ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། དེས་པ་དག་གིས་མངོན་པར་བརྩོན་པར་བྱས་པར་གྱུར་ཏོ།
en: They all renounced saṃsāra, took ordination, and dedicated themselves to correct conduct, listening to the Dharma, meditation, and gentleness. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཐད་ནས་མཐར་གྱིས་ཉན་ཐོས་ཀྱི་ཐེག་པའི་གཏམ་གྱི་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་བཀླགས་ཤིང་ཀུན་ཆུབ་པར་བྱས་སོ། །རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་གཏམ་གྱི་ཆོས་ཀྱི་ཕུང་པོ་དགུ་ཁྲི་ལུང་མནོས་ཤིང་བཀླགས་ཏེ་ཀུན་ཆུབ་པའི་བར་དུ་བྱས་སོ། །དེ་བཞིན་དུ་བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོའི་གཏམ་ལ་ཡང་ལུས་དྲན་པ་ཉེ་བར་གཞག་པའི་གཏམ་འབུམ་ལུང་མནོས་ཤིང་བཀླགས་ཏེ་ཀུན་ཆུབ་པར་བྱས་སོ། །ཚོར་བ་དྲན་པ་ཉེ་བར་གཞག་པའི་གཏམ་འབུམ་དང་། སེམས་དྲན་པ་ཉེ་བར་གཞག་པའི་གཏམ་འབུམ་དང་།
en: Noble son, the bodhisattva mahāsattva Mahākāruṇika received, read, and comprehended from the Tathāgata Ratnagarbha the successive 84,000 Dharma teachings of the Śrāvakayāna.

source: ཆོས་དྲན་པ་ཉེ་བར་གཞག་པའི་གཏམ་འབུམ་ཡང་ལུང་མནོས་ཏེ་བཀླགས་ཤིང་ཀུན་ཆུབ་པར་བྱས་སོ། །ཁམས་ཀྱི་ཚོགས་ཀྱི་གཏམ་འབུམ་དང་།
en: He received, read, and comprehended the 90,000 Dharma teachings of the Pratyekabuddhayāna.

source: སྐྱེ་མཆེད་ཀྱི་ཚོགས་ཀྱི་གཏམ་འབུམ་དང་། འདོད་ཆགས་ཀྱི་ཀུན་ཏུ་སྦྱོར་བ་སྤོང་བའི་ཚོགས་ཀྱི་གཏམ་འབུམ་དང་། ཞེ་སྡང་གི་ཀུན་ཏུ་སྦྱོར་བ་སྤོང་པའི་ཚོགས་ཀྱི་གཏམ་འབུམ་དང་། གཏི་མུག་གི་ཀུན་ཏུ་སྦྱོར་བ་སྤོང་བའི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཚོགས་ཀྱི་གཏམ་འབུམ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: In the same way he received, read, and comprehended the Dharma teachings of the unsurpassable Mahāyāna: the hundred thousand teachings on mindfulness of the body, the hundred thousand teachings on mindfulness of sensations, the hundred thousand teachings on mindfulness of the mind’s thoughts, the hundred thousand teachings on mindfulness of phenomena, the hundred thousand teachings on the aggregation of the sensory elements, the hundred thousand teachings on the aggregation of the sensory bases, the hundred thousand teachings on the aggregation of abandoning the fetter of desire, the hundred thousand teachings on the aggregation of abandoning the fetter of anger, the hundred thousand teachings on the aggregation of the dependent origination of abandoning the fetter of ignorance, and the hundred thousand teachings on the aggregation of samādhi and liberation.

source: རྣམ་པར་ཐར་པའི་ཚོགས་ཀྱི་གཏམ་འབུམ་དང་། སྟོབས་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་ཚོགས་ཀྱི་གཏམ་འབུམ་ཡང་ལུང་མནོས་ཤིང་བཀླགས་ཏེ་ཀུན་ཆུབ་པར་བྱས་སོ། །དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཐད་ནས་ཆོས་ཀྱི་ཕུང་པོ་འབུམ་ཕྲག་བཅུའི་བར་དག་ཀྱང་བཟུང་ཞིང་བཀླགས་ཏེ་ཀུན་ཆུབ་པར་བྱས་སོ།
en: In the same way, he received, read, and comprehended the hundred thousand teachings on the aggregation of the strengths, the fearlessnesses, and the Buddha’s distinct qualities, until he had received, read, and comprehended a million Dharma teachings from the Tathāgata Ratnagarbha. “

source: །རིགས་ཀྱི་བུ་ཇི་ཙམ་གྱི་དུས་གཞན་ཞིག་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་།
en: Noble son, at a later time, the tathāgata arhat samyaksam­buddha Ratnagarbha passed into parinirvāṇa, into the state of nirvāṇa with no remainder.

source: བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་རོལ་མོའི་སྒྲ་དང་། མེ་ཏོག་དང་། ཕྱེ་མ་དང་། མེ་ཏོག་ཕྲེང་དང་། སྤོས་དང་། བྱུག་པ་དང་།
en: The bodhisattva mahāsattva Mahākāruṇika made offerings to him of countless, innumerable varieties of music, flowers, incense powder, flower garlands, incense, perfumes, parasols, victory banners, flags, and jewels.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད། གྲངས་མེད་པ་དག་གིས་མཆོད་པ་བྱས་ཤིང་སྤོས་ཆུ་སྣ་ཚོགས་ཀྱིས་བཀྲུས་ནས།
en: He bathed the Tathāgata Ratnagarbha with a variety of scented waters.

source: སྐུ་གདུང་གཞག་པའི་མཆོད་རྟེན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་འཕང་དུ་དཔག་ཚད་ལྔ་བརྒྱ་རྒྱར་ནི་དཔག་ཚད་ཕྱེད་ཡོད་པ་ཡང་བརྩིགས།
en: He erected a stūpa for his relics that was made of the seven jewels and was five yojanas tall and half a yojana wide.

source: དེ་ནས་ཞག་བདུན་གྱི་བར་དུ་རོལ་མོའི་སྒྲ་དང་། མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་དང་། སྤོས་དང་། བྱུག་པ་དང་།
en: Then for seven days he made offerings to it of countless, innumerable varieties of precious music, flowers, flower garlands, incense, perfumes, parasols, victory banners, flags, and jewels.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རིན་པོ་ཆེ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་གིས་མཆོད་པ་བྱས་ནས་དེར་ཡང་སེམས་ཅན་དཔག་ཏུ་མེད། གྲངས་མེད་པ་དག་ཐེག་པ་གསུམ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: He made countless, innumerable beings there obtain, enter, and remain in the three yānas. “

source: །དེ་ཞག་བདུན་པོ་དེ་དག་འདས་ནས་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ལྷན་ཅིག་ཏུ་མངོན་པར་བྱུང་སྟེ། སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་དག་བགོས་ཏེ།
en: When those seven days had passed, together with 84,000 beings he left the lay life, shaved off his hair and beard, put on the orange robes, and with true faith took ordination, leaving the householder’s life for the homeless life.

source: ཡང་དག་པར་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བསྟན་པ་འབར་བར་བྱས་ཏེ།
en: He made the teachings of the Tathāgata Ratnagarbha, who had passed into parinirvāṇa, shine.

source: ལོ་ཁྲིའི་བར་དུ་དམ་པའི་ཆོས་འཛིན་པར་གྱུར་ནས། དེར་ཡང་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཐེག་པ་གསུམ་པོ་དག་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: For ten thousand years he maintained the Dharma and made countless, innumerable beings there obtain, enter, and remain in the three yānas.

source: །གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ལ་ཡང་རབ་ཏུ་བཀོད་དོ། །དགེ་བསྙེན་གྱི་སྡོམ་པ་དང་། དགེ་ཚུལ་གྱི་སྡོམ་པ་དང་། བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཚངས་པར་སྤྱོད་པའི་སྡོམ་པ་ལ་ཡང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: He also made them take refuge in the Three Jewels, take the upāsaka vows, take the novice vows, and obtain and remain in the vows of the celibate bhikṣu.

source: །དེས་ཡང་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་མངོན་པར་ཤེས་པ་དང་། རྫུ་འཕྲུལ་ལ་མཁས་པ་ལ་ངེས་པར་སྦྱར་ཅིང་དེས་པ་དང་།
en: He guided many hundreds of millions of trillions of beings to the clairvoyances and the mastery of miracles.

source: ཚངས་པར་སྤྱོད་པའི་གནས་ལ་ཡང་ངེས་པར་སྦྱར། ཕུང་པོ་རྣམས་དགྲ་ལྟ་བུར་གྱུར་པར་ཡོངས་སུ་ཤེས་པ་ལ་ཡང་ངེས་པར་སྦྱར།
en: He brought them to the state of pure conduct; he made them understand that the aggregates are enemies.

source: སྐྱེ་མཆེད་རྣམས་གྲོང་སྟོང་པ་ལྟ་བུར་ཡོངས་སུ་ཤེས་པ་ལ་ཡང་ངེས་པར་སྦྱར།
en: He made them understand that the sensory bases are like an empty village.

source: ཆོས་ཐམས་ཅད་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའོ་ཞེས་འདུས་བྱས་ཤེས་པ་མཐོང་བ་ཡོངས་སུ་ཤེས་པ་ལ་ཡང་ངེས་པར་སྦྱར།
en: He made them perceive the knowledge of the composite, that all phenomena are dependently arisen.

source: ཆོས་ཐམས་ཅད་མིག་ཡོར་ལྟ་བུ་དང་། མིག་སྒྱུ་ལྟ་བུ་དང་། ཆུ་ཟླ་ལྟ་བུར་ཡང་བསྟན། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། མཚམས་སྦྱོར་བ་མེད་པའི་འགོག་པ་དང་།
en: He made them see that all phenomena are like illusions, mirages, and the moon’s reflection on water.

source: ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་། ཉེ་བར་ཞི་བ་དང་། མཆོག་དང་། གྱ་ནོམ་པའི་འགོག་པ་མྱ་ངན་ལས་འདས་པ་ཡོངས་སུ་ཤེས་པ་ཡང་བསྟན་ཏེ།
en: He made them see the knowledge of birthlessness, noncessation, no transition, cessation, tranquility, peace, stillness, the supremely accomplished cessation, and nirvāṇa.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་རབ་ཏུ་བཀོད་ནས་འཆི་བའི་དུས་བྱས་པར་གྱུར་ཏོ།
en: He guided them onto the eightfold noble path, and then he passed away. “

source: །སེམས་ཅན་དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དགེ་སྦྱོང་ཆེན་པོ་དེའི་རུས་པ་ལ་སྔ་མ་བཞིན་དུ་མཆོད་པ་བྱས་ཏེ།
en: Those beings made the funeral offerings, as previously described, to the relics of the great mendicant, the bodhisattva mahāsattva Mahākāruṇika.

source: ཇི་ལྟར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་རུས་པ་དག་ལ་རུས་པའི་མཆོད་པ་བྱེད་པ་དེ་བཞིན་དུ། དེའི་ཚེ་ན་སེམས་ཅན་དེ་དག་གིས་ཀྱང་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་དགེ་སྦྱོང་ཆེན་པོ་དེའི་རུས་པ་དག་ལ་མཆོད་པ་བྱས་སོ།
en: Just as the funeral offerings are made to the relics of a cakravartin king, those beings at that time made offerings to the relics of the great mendicant Mahākāruṇika. “

source: །གང་གི་ཉིན་མོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་དགེ་སྦྱོང་ཆེན་པོ་འཆི་བའི་དུས་བྱས་པར་གྱུར་པ་དེའི་ཉིན་མོ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་དམ་པའི་ཆོས་ཀྱང་ནུབ་སྟེ།
en: On the day that the great mendicant Mahākāruṇika passed away, the Dharma of the Tathāgata Ratnagarbha also came to an end.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་ནི་སྨོན་ལམ་གྱི་དབང་གིས་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ཏུ་སྐྱེ་བ་ཡོངས་སུ་བཟུང་སྟེ།
en: The bodhisattva mahāsattvas, in accordance with their prayers, took rebirths in other realms.

source: ཁ་ཅིག་ནི་སྨོན་ལམ་གྱི་དབང་གིས་དགའ་ལྡན་གྱི་གནས་སུ་སྐྱེས་སོ། །ཁ་ཅིག་ནི་མི་རྣམས་ཀྱི་ནང་དུ། ཁ་ཅིག་ནི་ཀླུ་རྣམས་ཀྱི་ནང་དུ། ཁ་ཅིག་ནི་ལྷ་མ་ཡིན་རྣམས་ཀྱི་ནང་དུ། ཁ་ཅིག་ནི་སྨོན་ལམ་གྱི་དབང་གིས་དུད་འགྲོའི་སྐྱེ་གནས་སྣ་ཚོགས་དག་ཏུ་སྐྱེས་སོ།
en: Some, through the power of their prayers, were reborn in Tuṣita, some were reborn among humans, some were reborn among the nāgas, some were reborn among the asuras, and some, through the power of their prayers, were reborn as various animals. “

source: །རིགས་ཀྱི་བུ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་དགེ་སྦྱོང་ཆེན་པོ་འཆི་བའི་དུས་བྱས་ནས་ཀྱང་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ཁྲི་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡང་དག་འདྲེན་ཅེས་བྱ་བ་ཡོད་དེ།
en: Noble son, the great mendicant Mahākāruṇika, having passed away, through the power of his prayers was reborn in a realm called Saṃkarṣana, ten thousand buddha realms to the south of this buddha realm.

source: དེ་ན་མི་རྣམས་ནི་ཚེ་ལོ་བརྒྱད་ཅུ་ཐུབ་ལ། མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་གཏུམ་པ། ལག་པ་ཁྲག་གིས་གོས་པ། སྡིག་པ་ལ་ཞེན་པ། སེམས་ཅན་ཐམས་ཅད་ལ་བརྩེ་བ་མེད་པར་ཞུགས་པ།
en: There humans had a lifespan of eighty years, and they were all engaged in cultivating bad roots, they were savage, their hands were stained with blood, they were addicted to evil deeds, they were cruel to all beings, they had no respect for their mothers, they had no respect for their fathers, and they were not afraid of the next world.

source: མར་མི་འཛིན་པ། ཕར་མི་འཛིན་པ། འཇིག་རྟེན་ཕ་རོལ་ལ་འཇིགས་པར་མི་ལྟ་བ་ཤ་སྟག་སྟེ། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་དགེ་སྦྱོང་ཆེན་པོ་དེ་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་འདྲེན་དེར་གདོལ་པའི་རིགས་སུ་སྐྱེས་པར་གྱུར་ཏེ།
en: The great mendicant Mahākāruṇika, through the power of his prayer, was reborn in Saṃkarṣana into a caṇḍāla family.

source: དེ་ཡང་ལུས་ཤིན་ཏུ་རིང་བར་གྱུར་ཅིང་། ཤིན་ཏུ་སྟོབས་དང་ལྡན་པ། ཤིན་ཏུ་ཤུགས་དང་ལྡན་པ། ཤིན་ཏུ་དྲན་པ་དང་ལྡན་པ། ཤིན་ཏུ་སྤོབས་པ་དང་ལྡན་པ།
en: His body was very tall, he was very strong, he was very powerful, he had a powerful memory, he was very eloquent, and he was very fast.

source: ཤིན་ཏུ་མགྱོགས་པ་དང་ལྡན་པར་གྱུར་ནས། དེས་སྟོབས་ཀྱི་ཤུགས་བརྟན་པས་སེམས་ཅན་དག་བཟུང་སྟེ་སྨྲས་པ། ཀྱེ་སེམས་ཅན་དག་ཁྱེད་ཅག་གལ་ཏེ་སྲོག་གཅོད་པ་སྤོང་བ་དང་། མ་བྱིན་པར་ལེན་པ་སྤོང་བ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་དང་།
en: With the unwavering power of his strength he would seize people and say to them, ‘O beings, if you give up killing, give up taking what has not been given, give up sexual misconduct, and so on, up to and including giving up wrong views, I will let you live, and I will also give you the necessities for life.

source: ལོག་པར་ལྟ་བའི་བར་དག་སྤོང་བར་བྱེད་ན་ངས་ཁྱེད་ཅག་གི་སྲོག་སྦྱིན་པར་བྱ་ཞིང་། འཚོ་བའི་ཡོ་བྱད་དག་ཀྱང་སྦྱིན་པར་བྱའོ། །ཀྱེ་གལ་ཏེ་མི་སྤོང་ན་ངས་སྲོག་དང་ཕྲལ་ཏེ་འགྲོའོ། །དེ་ནས་སེམས་ཅན་དེ་དག་གིས་ཐལ་མོ་སྦྱར་ཏེ་སྨྲས་པ།
en: If you don’t give them up, I will take your life from you and leave.’ “

source: མགོན་པོ་ཁྱོད་ཀྱི་ཚིག་གིས་བདག་ཅག་ད་དེང་སླན་ཆད་ནས་ཇི་སྲིད་འཚོ་བའི་བར་དུ་སྲོག་གཅོད་པ་དང་མ་བྱིན་པར་ལེན་པ་ནས་ལོག་པར་ལྟ་བའི་བར་དག་སྤོང་བར་བགྱིད་དོ། །གདོལ་པ་སྟོབས་ཅན་དེ་སོང་ནས་རྒྱལ་པོ་དང་། རྒྱལ་པོས་བཀྲབས་པ་དག་ལ་བསྒོ་བ་ཁོ་བོའི་འཚོ་བའི་ཡོ་བྱད་དུ་ཟས་དང་། སྐོམ་དང་། བཟའ་བ་དང་། བཅའ་བ་དང་། བཏུང་བ་དང་། གོས་དང་།
en: Those beings would then put their palms together and say, ‘We will obey your words, lord, and will give up, for the rest of our lives, killing, taking what has not been given, and so on, up to and including having wrong views.’ “

source: མལ་ཆ་དང་། སྤོས་དང་། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་།
en: The strong caṇḍāla went and spoke to the king and his ministers, saying, ‘I need necessities for life: food and drink, that which can be eaten and that which can be drunk, a bed, incense, cowries, gold, gems, pearls, beryls, conch, crystal, coral, silver, and golden objects.

source: དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་དག་དགོས་ཀྱིས་འཚོ་བའི་ཡོ་བྱད་མང་པོ་དག་ཁོ་བོ་ལ་ཕུལ་ཅིག །
en: So, give me many necessities for life.’ “

source: གདོལ་པ་སྟོབས་ཅན་དེས་ཇི་སྲིད་འཚོ་བའི་བར་དུ་སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་པ་དང་། དེ་ནས་མི་དེ་དག་ཀྱང་ཚེ་ལོ་ལྔ་བརྒྱ་ཐུབ་པར་གྱུར་ཏོ།
en: For as long as that strong caṇḍāla lived, he brought beings onto the path of the ten good actions, and the lifespan of those humans increased to five hundred years.
